Revit 2024 API
FabricationPartSizeMap Constructor (String, Double, Double, Boolean, ConnectorProfileType, Int32, Int32)
 Creates a new instance of the FabricationPartSizeMap class.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.2
Syntax
C#
public FabricationPartSizeMap(
	string size,
	double widthDiameter,
	double depth,
	bool isProductList,
	ConnectorProfileType profileType,
	int serviceId,
	int paletteId
)
Visual Basic
Public Sub New ( _
	size As String, _
	widthDiameter As Double, _
	depth As Double, _
	isProductList As Boolean, _
	profileType As ConnectorProfileType, _
	serviceId As Integer, _
	paletteId As Integer _
)
Visual C++
public:
FabricationPartSizeMap(
	String^ size,
	double widthDiameter,
	double depth,
	bool isProductList,
	ConnectorProfileType profileType,
	int serviceId,
	int paletteId
)
Parameters
size
Type: System.String
 The size display string for the straight that can be used by the user interface.
widthDiameter
Type: System.Double
 The width or diameter of the straight.
depth
Type: System.Double
 The depth of the straight.
isProductList
Type: System.Boolean
 Set if the straight a product list or not.
profileType
Type: Autodesk.Revit.DB.ConnectorProfileType
 Set the shape of the straight.
serviceId
Type: System.Int32
 Set the service identifier of the straight.
paletteId
Type: System.Int32
 Set the palette identifier of the straight.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
FabricationPartSizeMap Class
FabricationPartSizeMap Overload
Autodesk.Revit.DB.Fabrication Namespace